<?php

$_['text_error_custom'] = 'يجب ان تكون القيمة مطابقة للنمط المذكور فقط';
$_['text_error_alphanumeric'] = 'يجب ان تحتوي القيمة على حروف و ارقام فقط';
$_['text_error_alpha'] = 'يجب ان تحتوي القيمة على حروف فقط';
$_['text_error_num'] = 'يجب ان تحتوي القيمة على ارقام فقط';
$_['text_error_float'] = 'يجب ان تحتوي القيمة على ارقام صحيحة او كسور عشرية فقط';
$_['text_error_date'] = 'عفوا التاريخ الذي قمت بادخاله غير صحيح في التنسيق (yyyy-mm-dd)';
$_['text_error_required'] = 'حقل بيانات مطلوب';
$_['text_error_strbetween'] = 'عدد الاحرف اقل او ازيد من المطلوب';
$_['text_error_intbetween'] = 'الرقم اقل او ازيد من المطلوب';
$_['text_error_equals'] = 'القيمة غير مطابقة للقيمة المطلوبة';
$_['text_error_lt'] = 'عدد الاحرف او الرقم يجب ان يكون اقل من القيمة المحددة';
$_['text_error_gt'] = 'عدد الاحرف او الرقم يجب ان يكون أكبر من القيمة المحددة';
$_['text_error_lte'] = 'عدد الاحرف او الرقم يجب ان يكون اقل من او يساوي القيمة المحددة';
$_['text_error_gte'] = 'عدد الاحرف او الرقم يجب ان يكون أكبر من او يساوي القيمة المحددة';
$_['text_error_email'] = 'يجب ان تكون القمية على هيئة بريد الكتروني';
$_['text_error_url'] = 'يجب ان تكون القيمة رابط الكتروني';
$_['text_error_file'] = 'هذا الملف مطلوب';
